Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: This subscript takes an index into the dictionary, instead of a key, and returns the corresponding key-value pair as a tuple.
ja: この添え字は辞書に対してのインデックスをとります、キーではなく、そして該当するキー値ペアをタプルとして返します。

source: This type does not carry an owner pointer unlike the other C*Pointer types because it only needs to reference the results of inout conversions, which already have writeback-scoped lifetime.
ja: この型は、他のC*Pointer型と違って所有ポインタを持ち運びません、なぜならそれはただインアウト変換の結果を参照する必要があるだけだからです、そしてそれは既にライトバックスコープの寿命を持ちます。

source: This type has implicit conversions to allow passing any of the following to a C or ObjC API:
ja: この型は暗黙的な変換を持ち、それによって以下のことをCまたはObjC APIへ渡すことを可能にされます：

source: This type is specificially not Sendable.
ja: この型は、はっきりとSendableではありません。

source: This type must conform to StringInterpolationProtocol and have a matching StringLiteralType.
ja: この型は、StringInterpolationProtocolに準拠する、そして適合するStringLiteralTypeを持つ必要があります。

source: This unexpected result occurs because the call to type(of: value) inside printGenericInfo(_:) must return a metatype that is an instance of T.Type, but String.self (the expected dynamic type) is not an instance of P.Type (the concrete metatype of value).
ja: この予期しない結果は、type(of: value)への呼び出しがprintGenericInfo(_:)内部において、T.Typeのインスタンスであるメタタイプを返さなければならない、しかしString.self（期待された動的型）はP.Type（valueの具象メタタイプ）のインスタンスでないことから起こります。

source: This value compares greater than or equal to all finite numbers, but less than infinity.
ja: この値は、すべての有限数、しかし無限大より少ないものに対してより大きいか等しいと比較されます。

source: This value compares less than or equal to all positive normal numbers.
ja: この値は、すべての正のノーマル数に対してより少ないか等しいと比較されます。

source: This value compares less than or equal to all positive numbers, but greater than zero.
ja: この値は、すべての正の数、しかしゼロより大きいものに対してより少ないか等しいと比較されます。

source: This value corresponds to type-specific C macros such as FLT_MAX and DBL_MAX.
ja: この値は、型固有のCマクロ、例えばFLT_MAXおよびDBL_MAXに相当します。

source: This value corresponds to type-specific C macros such as FLT_MIN and DBL_MIN.
ja: この値は、型固有のCマクロ、例えばFLT_MINおよびDBL_MINに相当します。

source: This value is unadjusted by the type’s exponent bias.
ja: これは、この型のもつ指数バイアスによって未調整のものです。

source: This value should be rounded toward zero to keep user computations with angles from inadvertently ending up in the wrong quadrant.
ja: この値は、角度を伴うユーザ計算がうっかりして間違った象限に終わらないようにゼロへと丸められるべきです。

source: This will be the same as either CSignedChar (in the common case) or CUnsignedChar, depending on the platform.
ja: これは、プラットホーム次第で、CSignedChar（一般的な場合）またはCUnsignedCharのどちらかに同じです。

source: Throw Errors
ja: エラーをスローする

source: Throw and Catch Errors from Custom Error Domains
ja: あつらえのエラー領域からエラーをスローおよびキャッチする

source: Throw and catch errors that use Cocoa's error types.
ja: Cocoaのエラー型を使うエラーをスローおよびキャッチします。

source: Throwing an error in one of the tasks of a task group doesn’t immediately cancel the other tasks in that group.
ja: あるエラーをタスクグループのタスクそれらの１つにおいてスローすることは、直ぐにそのグループの中の他のタスクを取り消しません。

source: To access a slice of a collection using a range expression, use the collection’s generic subscript that uses a range expression as its parameter.
ja: 範囲式を使ってコレクションのスライスにアクセスするには、そのコレクションの持つ総称体添え字で、範囲式をそれのパラメータとして使うものを使用してください。

source: To access the stride, use MemoryLayout<Pointee>.stride.
ja: ストライドにアクセスするには、MemoryLayout<Pointee>.strideを使ってください。

source: To add AdditiveArithmetic protocol conformance to your own custom type, implement the required operators, and provide a static zero property.
ja: AdditiveArithmeticプロトコル準拠をあなた自身のあつらえの型に加えるには、必要とされる演算子を実装してください、そしてある静的zeroプロパティを提供してください。

source: To add BidirectionalProtocol conformance to your custom types, implement the index(before:) method in addition to the requirements of the Collection protocol.
ja: BidirectionalProtocol準拠をあなたのあつらえの型に加えるには、index(before:)メソッドを、Collectionプロトコルの要件に加えて実装してください。

source: To add Comparable conformance to Date, first declare conformance to Comparable and implement the < operator function.
ja: Comparable準拠をDateに加えるには、最初にComparableへの準拠を宣言して、<演算子関数を実装してください。

source: To add Comparable conformance to your custom types, define the < and == operators as static methods of your types.
ja: Comparable準拠をあなたのあつらえの型に加えるには、<および==演算子をあなたの型の静的メソッドとして定義してください。

source: To add CustomPlaygroundDisplayConvertible conformance to your custom type, implement the playgroundDescription property.
ja: CustomPlaygroundDisplayConvertible準拠をあなたのあつらえの型に加えるには、playgroundDescriptionプロパティを実装してください。

source: To add ExpressibleByBooleanLiteral conformance to your custom type, implement the init(booleanLiteral:) initializer that creates an instance of your type with the given Boolean value.
ja: ExpressibleByBooleanLiteral準拠をあなたのあつらえの型に加えるにはinit(booleanLiteral:)イニシャライザを加えてください、それはあなたの型のインスタンスを、与えられたブール値とともに作成します。

source: To add ExpressibleByExtendedGraphemeClusterLiteral conformance to your custom type, implement the required initializer.
ja: ExpressibleByExtendedGraphemeClusterLiteral準拠をあなたのあつらえの型に加えるには、必須イニシャライザを実装してください。

source: To add ExpressibleByFloatLiteral conformance to your custom type, implement the required initializer.
ja: ExpressibleByFloatLiteral準拠をあなたのあつらえの型に加えるには、必須イニシャライザを実装してください。

source: To add ExpressibleByIntegerLiteral conformance to your custom type, implement the required initializer.
ja: ExpressibleByIntegerLiteral準拠をあなたのあつらえの型に加えるには、必須イニシャライザを実装してください。

source: To add ExpressibleByStringLiteral conformance to your custom type, implement the required initializer.
ja: ExpressibleByStringLiteral準拠をあなたのあつらえの型に加えるには、必須イニシャライザを実装してください。

source: To add ExpressibleByUnicodeScalarLiteral conformance to your custom type, implement the required initializer.
ja: ExpressibleByUnicodeScalarLiteral準拠をあなたのあつらえの型に加えるには、必須イニシャライザを実装してください。

source: To add Collection conformance to your type, you must declare at least the following requirements:
ja: Collection準拠をあなたの型に加えるには、あなたは少なくとも以下の要件を宣言しなければなりません：

source: To add Hashable conformance, provide an == operator function and implement the hash(into:) method.
ja: Hashable準拠を加えるには、==演算子関数を提供して、hash(into:)メソッドを実装してください。

source: To add a new key-value pair, assign a value to a key that isn’t yet a part of the dictionary.
ja: 新しいキー値ペアを加えるには、ある値を、まだ辞書の一部ではないキーに対して割り当ててください。

source: To add single elements to the end of an array, use the append(_:) method.
ja: 単一の要素を配列に加えるには、append(_:)メソッドを使ってください。

source: To add the capability to be initialized with a dictionary literal to your own custom types, declare an init(dictionaryLiteral:) initializer.
ja: 辞書リテラルで初期化される能力をあなた独自のあつらえの型に加えるには、init(dictionaryLiteral:)イニシャライザを宣言してください。

source: To add values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を加算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To avoid the unexpected copy, use the index(after:) method starting with startIndex to produce indices instead.
ja: 予期されないコピーを避けるために、代わりにindex(after:)メソッドを使ってstartIndexで始めることで、インデックスを生成してください。

source: To avoid this behavior, swap the call isKnownUniquelyReferenced(_:) to the left-hand side or store the result of the first expression in a local constant:
ja: この挙動を防ぐために、左手側への呼び出しisKnownUniquelyReferenced(_:)を交換するか、最初の式の結果をローカル定数の中に格納してください。

source: To avoid this, use a forward declaration of the Swift class or protocol to reference it in an Objective-C interface.
ja: これを防ぐために、Swiftクラスまたはプロトコルの前方宣言を使うことで、それをObjective-Cインターフェイスにおいて参照してください。

source: To check for invalid usage in Release builds, see precondition(_:_:file:line:).
ja: 「リリース」ビルドにおける無効な使用法を調べるには、precondition(_:_:file:line:)を見てください。

source: To check whether a collection is empty, use its isEmpty property instead of comparing count to zero.
ja: あるコレクションが空かどうか調べるには、それのisEmptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To collect the results of tasks that were added to the group, you can use the following pattern:
ja: グループに追加されたいくつかのタスクの結果それらを収集するには、あなたは以下の手本を使用できます：

source: To conform to Hashable, implement the hash(into:) requirement instead.
ja: Hashableに準拠するには、hash(into:)要件を代わりに実装してください。

source: To create a continuation in asynchronous code, call the withUnsafeContinuation(function:_:) or withUnsafeThrowingContinuation(function:_:) function.
ja: ある継続を非同期コードにおいて作成するには、withUnsafeContinuation(function:_:)またはwithUnsafeThrowingContinuation(function:_:)関数を呼び出してください。

source: To create a dictionary with no key-value pairs, use an empty dictionary literal ([:]).
ja: キー値ペアを持たない辞書を作成するには、空の辞書リテラル（[:]）を使ってください。

source: To create a new type that supports string literals and interpolation, but that doesn’t need any custom behavior, conform the type to ExpressibleByStringInterpolation and implement the init(stringLiteral: String) initializer declared by the ExpressibleByStringLiteral protocol.
ja: 文字列リテラルと補間をサポートする、しかし何らかのあつらえの挙動を必要としない新しい型を作成するには、その型をExpressibleByStringInterpolationに準拠させて、そしてExpressibleByStringLiteralプロトコルによって宣言されるinit(stringLiteral: String)イニシャライザを実装してください。

source: To create a wrapper for the c_api function, write a function that takes CVarArg arguments, and then call the imported C function using the withVaList(_:_:) function:
ja: c_api関数に対するラッパーを作成するには、CVarArg引数をとる関数を書いて、それからインポートされたC関数をwithVaList(_:_:)関数を使って呼び出してください：

source: To create an instance of EnumeratedSequence, call enumerated() on a sequence or collection.
ja: EnumeratedSequenceのインスタンスを作成するには、enumerated()をシーケンスまたはコレクション上で呼び出してください。

source: To create an instance, call enumerated().makeIterator() on a sequence or collection.
ja: インスタンスを作成するには、enumerated().makeIterator()をシーケンスまたはコレクション上で呼び出してください。

source: To customize that representation, make your type conform to the CustomDebugStringConvertible protocol.
ja: この表現をカスタマイズするには、あなたの型をCustomDebugStringConvertibleプロトコルに準拠させてください。

source: To customize your type’s Equatable conformance, to adopt Equatable in a type that doesn’t meet the criteria listed above, or to extend an existing type to conform to Equatable, implement the equal-to operator (==) as a static method of your type.
ja: あなたの型のもつEquatableable準拠をカスタマイズするため、Equatableを上でリストされる基準に沿わない型において採用するため、または既存の型を拡張してEquatableに準拠するためには、同等演算子（==）をあなたの型の静的メソッドとして実装してください。

source: To customize your type’s Hashable conformance, to adopt Hashable in a type that doesn’t meet the criteria listed above, or to extend an existing type to conform to Hashable, implement the hash(into:) method in your custom type.
ja: あなたの型のもつHashable準拠をカスタマイズするために、Hashableを上でリストされる基準に沿わない型において採用するために、または既存の型を拡張してHashableに準拠するためには、hash(into:)メソッドをあなたのあつらえの型において実装してください。

source: To declare a dictionary, assign a dictionary literal to a variable or constant:
ja: 辞書を宣言するには、辞書リテラルを変数または定数に割り当ててください。

source: To do so, start by creating two slices of the absences array.
ja: それをするには、absences配列の２つのスライスを作成することで始めます。

source: To do this, enclose a comma-separated list of values in square brackets.
ja: これをするには、コンマ区切りの値のリストを角括弧で囲んでください。

source: To ensure that your type meets the semantic requirements of the Hashable and Equatable protocols, it’s a good idea to also customize your type’s Equatable conformance to match.
ja: あなたの型がHashableとEquatableプロトコルの意味論的要件に沿うことを確実にするために、あなたの型のもつEquatable準拠が合致するように同様にカスタマイズすることは良い考えです。

source: To find the difference between two collections, use the difference(from:) method declared on the BidirectionalCollection protocol.
ja: ２つのコレクションの間の差異を見つけるには、BidirectionalCollectionプロトコル上で宣言されるdifference(from:)メソッドを使ってください。

source: To find the distance in bytes between two pointers, convert them to UnsafeRawPointer instances before calling distance(to:).
ja: ２つのポインタの間の隔たりをバイトで知るには、それらをUnsafeRawPointerインスタンスに、distance(to:)を呼ぶ前に変換してください。

source: To find the index of the day in question, follow these steps:
ja: 質問の日付のインデックスを見つけるには、これらの手順に従ってください：

source: To find the indices of the two days in question, follow these steps:
ja: 当該の２つの日付のインデックスを見つけるには、これらの手順を踏んでください：

source: To get the character’s value, use the hexDigitValue property.
ja: 文字のもつ値を取得するには、hexDigitValueプロパティを使ってください。

source: To get the dynamic type inside value in this generic context, cast the parameter to Any when calling type(of:).
ja: value内部の動的型をこの総称体の文脈において得るには、このパラメータをAnyへとtype(of:)を呼び出す時にキャストしてください。

source: To handle Objective-C exceptions, write Objective-C code that catches exceptions before they reach any Swift code.
ja: Objective-C例外を取り扱うには、それら例外をそれらが何らかのスウィフトコードに届く前に捕まえるObjective-Cコードを書いてください。

source: To implement your own AsyncSequence, implement a wrapped type that conforms to AsyncIteratorProtocol.
ja: あなた独自のAsyncSequenceを実装するには、AsyncIteratorProtocolに準拠するあるラップ型を実装してください。

source: To import a set of Objective-C files into Swift code within the same app target, you rely on an Objective-C bridging header file to expose those files to Swift.
ja: 一揃いのObjective-CファイルをSwiftコードへと同じアプリターゲット内でインポートするには、あなたはObjective-Cブリッジヘッダファイルを頼ることで、それらファイルをSwiftへと露出してください。

source: To import a set of Swift files in the same framework target as your Objective-C code, import the Xcode-generated header for your Swift code into any Objective-C .m file where you want to use your Swift code.
ja: 一揃いのSwiftファイルをあなたのObjective-Cコードと同じフレームワークターゲットの中でインポートするために、あなたのSwiftコードに対するXcode生成のヘッダを、そこにおいてあなたがあなたのSwiftコードを使うことを望む何らかのObjective-C .mファイルの中へとインポートしてください。

source: To iterate over the elements of a collection with its indices, use the zip(_:_:) function.
ja: あるコレクションの要素すべてにわたってそれのインデックスで反復するには、zip(_:_:)関数を使ってください。

source: To learn more about the open source Swift project and community, visit Swift.org.
ja: オープンソースSwiftプロジェクトおよびコミュニティについてもっと知るには、Swift.orgを訪れてください。

source: To learn which half had more absences, use the reduce(_:_:) method to calculate each sum.
ja: 前半後半のどちらがより多くの欠席者がいるか突き止めるには、reduce(_:_:)メソッドを使ってそれぞれ総計を計算します。

source: To maintain substitutability, the == operator should take into account all visible aspects of an Equatable type.
ja: 代替可能性を維持するために、==演算子はあるEquatable型の全ての目に見える面を考慮しなければならないでしょう。

source: To make Player conform to the Hashable protocol, declare conformance in another extension and implement the hash(into:) method.
ja: PlayerをHashableプロトコルに準拠させるには、準拠を別の拡張において宣言して、hash(into:)メソッドを実装してください。

source: To make this class conform to the Equatable protocol, declare conformance in an extension and implement the static == operator method.
ja: このクラスをEquatableプロトコルに準拠させるには、準拠をある拡張において宣言して、静的==演算子メソッドを実装してください。

source: To make your own custom type conform to the FixedWidthInteger protocol, declare the required initializers, properties, and methods.
ja: あなた独自のあつらえの型をFixedWidthIntegerプロトコルに準拠させるには、必須イニシャライザ、プロパティ、そしてメソッドを宣言してください。

source: To multiply values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を乗算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To prevent infinite loops, playground logging implementations can place a reasonable limit on this kind of chaining.
ja: 無限ループを防ぐには、プレイグラウンドログ実装はこの種の連鎖に関して妥当な制限を置くことができます。

source: To print the items separated by something other than a space, pass a string as separator.
ja: 空白以外の何かによって区切られる項目を出力するには、ある文字列をseparatorとして渡してください。

source: To print the items without a trailing newline, pass an empty string as terminator.
ja: 後に続く改行なしで項目を出力するには、空の文字列をterminatorとして渡してください。

source: To protect code from invalid usage in Release builds, see preconditionFailure(_:file:line:).
ja: 「リリース」ビルドにおける無効な使用法を調べるには、preconditionFailure(_:file:line:)を見てください。

source: To remove elements from an array, use the remove(at:), removeSubrange(_:), and removeLast() methods.
ja: 配列から要素を取り除くには、remove(at:)、removeSubrange(_:)、そしてremoveLast()メソッドを使ってください。

source: To remove the last element of a collection that might be empty, use the popLast() method instead.
ja: 空であるかもしれないあるコレクションの最後の要素を削除するには、popLast()関数を使ってください。

source: To resolve these errors, you can use withoutActuallyEscaping(_:do:) to get copies of f and g that can be passed to async(execute:).
ja: これらのエラーを解決するために、あなたはwithoutActuallyEscaping(_:do:)を使って、fとgのコピーを取得します、それはasync(execute:)に渡すことができます。

source: To resume the asynchronous task, call the resume(returning:), resume(throwing:), resume(with:), or resume() method.
ja: 非同期タスクを再開するには、resume(returning:)、resume(throwing:)、resume(with:)、またはresume()メソッドを呼び出してください。

source: To round a value using the default “schoolbook rounding”, you can use the shorter round() method instead.
ja: 省略時の「教科書丸め」を使って値を丸めるには、あなたはより短いround()メソッドを代わりに使うことができます。

source: To round a value using the default “schoolbook rounding”, you can use the shorter rounded() method instead.
ja: 省略時の「教科書丸め」を使って値を丸めるには、あなたはより短いrounded()メソッドを代わりに使うことができます。

source: To safely reference the starting and ending indices of a slice, always use the startIndex and endIndex properties instead of specific values.
ja: あるスライスの最初と最後のインデックスを安全に参照するために、常にstartIndexとendIndexプロパティを特定の値の代わりに使ってください。

source: To sort the elements of your collection in descending order, pass the greater-than operator (>) to the sort(by:) method.
ja: あなたのコレクションの要素を降順にソートするには、より大きい演算子（>）をsort(by:)メソッドに渡してください。

source: To sort the elements of your sequence in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのシーケンスの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort your sequence in descending order, pass the greater-than operator (>) as the areInIncreasingOrder parameter.
ja: あなたのシーケンスを降順にソートするには、より大きい演算子（>）をareInIncreasingOrderパラメータとして渡してください。

source: To specify an alternative rule for rounding, use the round(_:) method instead.
ja: 丸めのための代替の規則を指定するには、round(_:)メソッドを代わりに使ってください。

source: To specify an alternative rule for rounding, use the rounded(_:) method instead.
ja: 丸めのための代替の規則を指定するには、rounded(_:)メソッドを代わりに使ってください。

source: To start using the object, you use the takeUnretainedValue() function.
ja: そのオブジェクトの使用を開始するには、あなたはtakeUnretainedValue()関数を使用します。

source: To subtract values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を減算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To swap two elements of a mutable collection, use the swapAt(_:_:) method of that collection instead of this function.
ja: ある可変のコレクションの２つの要素を交換するには、そのコレクションのswapAt(_:_:)メソッドを、この関数の代わりに使ってください。

source: To use a dictionary literal as the initial value of a dictionary, enclose a comma-separated list of key-value pairs in square brackets.
ja: 辞書リテラルをある辞書の初期値として使うには、キー値ペアのコンマ区切りリストを角括弧で囲んでください。

source: To use the contains(_:) method without including a closure in each call, extend the StreetAddress type to conform to Equatable.
ja: contains(_:)メソッドを各呼び出しにクロージャを含めることなく使うには、StreetAddress型をEquatableに準拠するように拡張してください。

source: To use the Objective-C declarations in files in the same framework target as your Swift code, configure an umbrella header as follows:
ja: Objective-C宣言をあなたのSwiftコードと同じフレームワークターゲットの中のファイルにおいて使うには、アンブレラヘッダを以下のように構成設定してください：

source: To use your own custom type in a set or as the key type of a dictionary, add Hashable conformance to your type.
ja: あなた独自のあつらえの型を集合でまたは辞書のキー型として使うには、Hashable準拠をあなたの型に加えてください。

source: Toggles the Boolean variable’s value.
ja: ブール変数の持つ値を切り替えます。

source: Topics
ja: 話題

source: Tranforming a Range's Elements
ja: ある範囲の持つ要素を変換する

source: Transforming a Boolean
ja: ブールを変換する

source: Transforming a Dictionary
ja: 辞書の変形

source: Transforming a Dictionary's Elements
ja: 辞書の要素の変換

source: Transforming a Sequence
ja: シーケンスを変形する

source: Transforming an Array
ja: 配列の変形

source: Translates the given input from one Unicode encoding to another by calling the given closure.
ja: 指定された入力をあるユニコード符号化から別のものへと指定されたクロージャを呼び出すことによって翻訳します。

source: Traversing a Collection
ja: コレクションを辿っていく

source: Treat identity with care.
ja: 同一性を注意して取り扱ってください。

source: True if any lane of mask is true.
ja: マスクのどんなレーンもtrueならば、true。

source: True if every lane of mask is true.
ja: マスクのあらゆるレーンがtrueならば、true。

source: Tuple Comparison
ja: タプル比較

source: Two Date instances are equal if each of their corresponding properties is equal.
ja: ２つのDateインスタンスは、それらの対応するプロパティの各々が等しいならば等しいです。

source: Two edge cases are worth particular attention:
ja: ２つの境界事例は特別な注意を払う価値があります：

source: Two elements are incomparable if neither is ordered before the other according to the predicate.
ja: ２つの要素は、述部によるとどちらもが他の前に並べられるならば比較できない。

source: Two instances that are equal must feed the same values to Hasher in hash(into:), in the same order.
ja: 等しい２つのインスタンスは、同じ値をHasherへとhash(into:)において、同じ順序で与えなければなりません。

source: Two ranges are equal when they have the same lower and upper bounds.
ja: ２つの範囲は、それらが同じ下方および上方境界を持つとき等しいです。

source: Type Aliases
ja: 型エイリアス

source: Type Casting and Existential Types
ja: 型キャストと存在型

source: Type Inference of Array Literals
ja: 配列リテラルの型推論

source: Type Method
ja: 型メソッド

source: Type Methods
ja: 型メソッド

source: Type Properties
ja: 型プロパティ

source: Type Property
ja: 型プロパティ

source: Type-Erasing Wrappers
ja: 型消去ラッパー

source: Typed pointers are required to be properly aligned for their Pointee type.
ja: 型付ポインタは、適切にそれらのPointee型にアラインされることを要求されます。

source: Types conforming to AsyncIteratorProtocol should use the cancellation primitives provided by Swift’s Task API.
ja: AsyncIteratorProtocolに準拠する型は、SwiftのもつTask APIによって提供される取り消し原始関数を使うべきです。

source: Types that are not able to guarantee this performance must document the departure, because many collection operations depend on O(1) subscripting performance for their own performance guarantees.
ja: この性能を保証することが可能でない型は、その逸脱を文書化されなければなりません、なぜなら多くのコレクション演算はそれら自身の性能保証としてO(1)添え字操作性能に依存するからです。

source: Types that conform to Collection are expected to provide the startIndex and endIndex properties and subscript access to elements as O(1) operations.
ja: Collectionに準拠する型は、startIndexおよびendIndexプロパティと要素への添え字アクセスをO(1)演算として提供することを期待されます。

source: Types that conform to the CaseIterable protocol are typically enumerations without associated values.
ja: CaseIterableプロトコルに準拠する型は、概して関連値を持たない列挙です。

source: Types that conform to the CustomStringConvertible protocol can provide their own representation to be used when converting an instance to a string.
ja: CustomStringConvertibleプロトコルに準拠する型は、それら独自の表現を提供して、インスタンスが文字列に変換されるときに使われるようにできます。

source: Types that conform to the Equatable protocol can be compared for equality using the equal-to operator (==) or inequality using the not-equal-to operator (!=).
ja: Equatableプロトコルに準拠する型は、同等性を同等演算子（==）を使って、または不等性を不等演算子（!=）を使って比較されることができます。

source: Types that conform to the FloatingPoint protocol provide most basic (clause 5) operations of the IEEE 754 specification.
ja: FloatingPointプロトコルに準拠する型は、IEEE 754仕様の最も基本的な演算（５項）を提供します。

source: Types that implement alternative behaviors for a signaling NaN must document the departure.
ja: シグナルNaNに対する代替の挙動を実装する型は、その逸脱を文書化しなければなりません。

source: Types with Comparable conformance implement the less-than operator (<) and the equal-to operator (==).
ja: Comparable準拠を持つ型は、より少ない演算子（<）と同等演算子（==）を実装します。

source: Typically, you use this to transform from one type of element to another.
ja: 概して、あなたはこれを使ってある型の要素から別のものへと変換します。

source: Typically, you’ll iterate over these sequences with for await-in, like the base AsyncSequence you started with.
ja: 概して、あなたはそれらシーケンスのすべてにわたってfor await-inで反復処理をするでしょう、あなたがそれで始めた基本的なAsyncSequenceのように。

source: Unconditionally prints a given message and stops execution.
ja: 無条件に与えられたメッセージを出力して実行を停止します。

source: Under Build Settings, in Packaging, make sure the Defines Module setting for that framework target is set to Yes.
ja: 「Build Settings」の下、「Packaging」の中で、そのフレームワークターゲットのための「Defines Module」設定が「Yes」に設定されることを確認します。

source: Under Build Settings, in Packaging, make sure the Defines Module setting for the framework target is set to Yes.
ja: Build Settingsの下、Packagingにおいて、フレームワークターゲットに対するDefines Module設定がYesに設定されることを確実にしてください。

source: Understand How Error Parameters Are Imported
ja: どのようにエラーパラメータがインポートされるか理解する

source: Understand How Swift Imports Completion Handlers
ja: どのようにSwiftが完了ハンドラをインポートするか理解する
